In [1]:
%load_ext autoreload
%autoreload 2
import os
os.chdir('../')
print(os.getcwd())
from utils import read_table, eng_dict

try:
    os.makedirs('data/eng/')
except:
    pass

/home/valldabo/Documents/Hobby/PythonProjects/horseracing

In [2]:
agare = read_table('data/travdata/agare.txt', ['id', 'name', 'segrar', 'starter', 'proc'])
print(agare.shape)
agare.head()

(42963, 5)

b'Skipping line 42327: expected 5 fields, saw 6\nSkipping line 42604: expected 5 fields, saw 6\nSkipping line 42965: expected 5 fields, saw 7\n'

   id                         name  segrar  starter  proc
0   1        Sundberg Maria, Boden     0.0      0.0   0.0
1   2      Stall Shooter HB, Solna     2.0     27.0   7.0
2   3             Stall Frisk Luft     0.0      0.0   0.0
3   4        Remmen HB, Skellefteå     2.0     47.0   4.0
4   5  St Asagården HB o Tumult HB     0.0      2.0   0.0

In [3]:
agare.rename(columns=eng_dict).to_csv('data/eng/owners.csv', index=False)

In [4]:
age = read_table('data/travdata/age.txt', ['sex', 'age', 'segrar', 'starter', 'proc'])
print(age.shape)
age.head()

(42, 5)

  sex  age  segrar  starter  proc
0   H    2     426     2547    16
1   H    3    4238    24084    17
2   H    4    5569    30544    18
3   H    5    4350    26221    16
4   H    6    2736    19866    13

H - HINGST - STALLION - NOT CASTRATED 
S - STO - MARE - FEMALE
V - VALLACK - GELDING - CASTRATED STALLIN

In [5]:
age.sex = age.sex.map({'H':'STALLION', 'S':'MARE', 'V': 'GELDING'})

In [6]:
from utils import eng_dict
age.rename(columns=eng_dict).to_csv('data/eng/age.csv', index=False)

In [7]:
ban = read_table('data/travdata/ban.txt', ['id', 'bankod', 'bana', 'avstand', 'segrar', 'starter', 'proc', 'NA'])
print(ban.shape)
ban.head()

(170, 8)

   id bankod       bana  avstand  segrar  starter  proc  NA
0   3     AR     Arvika     50.0   126.0   2227.0   5.0 NaN
1   5     AX   Axevalla     44.0  2200.0  23267.0   9.0 NaN
2   6      B  Bergsåker     92.0  4417.0  45665.0   9.0 NaN
3   9     BJ     Bjerke    100.0  1027.0   9989.0  10.0 NaN
4  11     BL  Blommeröd     40.0    24.0    199.0  12.0 NaN

In [8]:
from utils import eng_dict
ban.rename(columns=eng_dict).to_csv('data/eng/curcuit.csv', index=False)

In [9]:
berakdatum = read_table('data/travdata/berakdatum.txt', ['id', 'tabell', 'datum', 'bana', 'tvlid'])
print(berakdatum.shape)
berakdatum.head()

(8, 5)

   id    tabell       datum bana  tvlid
0   1     Ägare  2018-12-29    E      0
1   2  KönÅlder  2018-12-29    S      0
2   3      Bana  2018-12-29    S      0
3   4    Hingst  2018-12-29    S      0
4   8      Spår  2018-12-29  NaN      0

In [10]:
color = read_table('data/travdata/color.txt', ['id', 'lb', 'ub', 'r', 'g', 'b'])
print(color.shape)
color.head()

(7, 6)

   id   lb    ub    r    g    b
0   6  NaN   NaN  251  253  200
1   5  NaN   NaN    0  128  255
2   4  5.5  99.0  234  234  234
3   3  3.5   5.5  128  255  255
4   2  1.5   3.5   69  194   98

In [11]:
ekvgrp = read_table('data/travdata/ekvgrp.txt', ['id', 'namn'])
print(ekvgrp.shape)
ekvgrp.head()

(2, 2)

   id       namn
0   1    F-värde
1   9  Utan Odds

In [12]:
galopp = read_table('data/travdata/galopp.txt', ['ant', 'segrar', 'starter', 'procent'])
print(galopp.shape)
galopp.head()

(11, 4)

   ant  segrar  starter  procent
0    0   12044   107474     1120
1    1    5079    61148      830
2    2    3412    40974      830
3    3    1984    24231      818
4    4     941    12864      731

In [13]:
garanti = read_table('data/travdata/garanti.txt', ['id', 'systemnr', 'rad', 'beskr'])
print(garanti.shape)
garanti.head()

(1917, 4)

     id  systemnr  rad                      beskr
0     1         1    1  Alltid 7 rätt om minst en
1     2         1    2             korrekt tippad
2  1889       484    1               Alla rätt om
3  1888       483    6                  B = 2 - 4
4     5         3    1                    A = 1-2

In [14]:
garanti.beskr = garanti.beskr.str.lower().str.replace('rätt', 'correct').str.replace('om', 'if').str.replace('alla', 'all')

In [15]:
from utils import eng_dict
garanti.rename(columns=eng_dict).to_csv('data/eng/guarantee.csv', index=False)

In [16]:
grafgrp = read_table('data/travdata/grafgrp.txt', ['id', 'grupp'])
print(grafgrp.shape)
grafgrp.head()

(2, 2)

   id   grupp
0   1   tider
1   2  Priser

In [17]:
grafrad = read_table('data/travdata/grafrad.txt', ['id', 'rad', 'variabel'])
print(grafrad.shape)
grafrad.head()

(5, 3)

   id  rad   variabel
0   1    1  TidSenast
1   1    2   TidBesta
2   1    3  Maskintid
3   2    1     Intakt
4   2    2   IntaktII

In [18]:
hingst = read_table('data/travdata/hingst.txt', ['id', 'namn', 'segrar', 'starter', 'proc', 'msegrar', 'mstarter', 'mproc'])
print(hingst.shape)
hingst.head()

(4759, 8)

   id            namn  segrar  starter  proc  msegrar  mstarter  mproc
0   1  RIDE THE NIGHT   823.0   9643.0   8.0    125.0    1288.0    9.0
1   2   ASPIRANT NIBS     2.0     70.0   2.0     88.0    1361.0    6.0
2   3       MR LUCKEN    24.0    253.0   9.0      6.0      38.0   15.0
3   4       DUKE IRAN     0.0      1.0   0.0     53.0     664.0    7.0
4   5     BUCK NEWTON    75.0   1172.0   6.0     89.0     922.0    9.0

In [19]:
from utils import eng_dict
hingst.rename(columns=eng_dict).to_csv('data/eng/stallion.csv', index=False)

In [20]:
horse = read_table('data/travdata/horse.txt', ['id', 'namn', 'intakt', 'intaktii', 'intaktperstart',
                                                                   'pliar1', 'pliar2', 'pliar3', 'starteriar', 'plfgar1', 'plfgar2', 
                                                                   'plfgar3', 'starterfgar', 'fodd', 'sex', 'hemmabana', 'v75segrar',
                                                                   'v75starter', 'v75proc', 'hingstid', 'morfarid', 'tranarid', 'agarid', 'nyckel', 'aktiverad'])
print(horse.shape)
horse.head()

(93682, 25)

,id,namn,intakt,intaktii,intaktperstart,pliar1,pliar2,pliar3,starteriar,plfgar1,...,hemmabana,v75segrar,v75starter,v75proc,hingstid,morfarid,tranarid,agarid,nyckel,aktiverad
0,50867,KOLAR SKAFFER,176850.0,100550.0,4570.0,0.0,0.0,0.0,10.0,3.0,...,H,NaN,NaN,NaN,4296.0,988.0,463.0,4088.0,556217.0,2011-05-18
1,2,A DE NIK GRANDE,135535.0,62364.0,2150.0,0.0,0.0,0.0,0.0,1.0,...,NaN,0.0,0.0,0.0,3.0,4.0,7261.0,31218.0,196099.0,NaN
2,5,A ONE,106542.0,0.0,NaN,0.0,0.0,0.0,0.0,1.0,...,NaN,0.0,0.0,0.0,13.0,0.0,2.0,2.0,0.0,NaN
3,7,A SIGN FROM HEAVEN,44900.0,0.0,NaN,0.0,0.0,0.0,0.0,0.0,...,NaN,0.0,0.0,0.0,15.0,1645.0,3.0,376.0,0.0,2010-02-08
4,50866,ASPE LEON,0.0,1600.0,0.0,0.0,0.0,0.0,1.0,0.0,...,H,NaN,NaN,NaN,276.0,885.0,570.0,21596.0,570499.0,NaN

In [21]:
from utils import eng_dict
horse.rename(columns=eng_dict).to_csv('data/eng/horse.csv', index=False)

In [22]:
kommentar = read_table('data/travdata/kommentar.txt', ['id', 'tvlid', 'spar', 'anm'], warn_bad_lines=False)[::2] #Seems like a parsing error, makes a new line instead of makeing the plac column
print(kommentar.shape)
kommentar.head()

(35821, 4)

      id  tvlid  spar                                                anm
0  61637  44923   1.0                      Prissumma för Emmy 149500 kr.
2  61636  44920   2.0  Super Man Vision är omgångens mest streckade h...
4  61635  44926   1.0              Lady S.S. har bästa platsprocent 100.
6  61634  44918   1.0  Medelplacering senaste 3 starter för Doc Holli...
8  61633  44919   1.0               Staro Tonic har flest raka segrar 3.

In [23]:
from utils import eng_dict
kommentar.rename(columns=eng_dict).to_csv('data/eng/comment.csv', index=False)

In [24]:
kommreg = read_table('data/travdata/kommreg.txt', ['nr', 'kommentar', 'sort', 'antal', 'vinster', 
                                                                       'ackvinstodds', 'proc', 'plats', 'plac', 'snittodds', 
                                                                       'vinstkr', 'vinstkrsort', 'totantal', 'totvinster', 
                                                                       'totproc', 'kommentar1', 'kommentar2'])
print(kommreg.shape)
kommreg.head()

(20, 17)

,nr,kommentar,sort,antal,vinster,ackvinstodds,proc,plats,plac,snittodds,vinstkr,vinstkrsort,totantal,totvinster,totproc,kommentar1,kommentar2
0,1,Mest streckad,3,7923,2847,82748,35.933359,4818,30275,29.0650,44.40240,6,14328,6242,44,@ är tävlingens mest streckade häst @@%.,@ är streckad på @@% av kupongerna.
1,2,Bästa maskintidsdifferens,7,13559,2917,135989,21.513386,6163,64527,46.6195,2.94269,9,14067,3031,22,@ har bästa maskintidsdifferens.,Kolla maskintiden för @.
2,3,Rankas 1:a av TravStat,2,12139,4405,118505,36.287997,7457,44575,26.9024,-23.76640,11,17307,6949,40,@ är bäst rankad i tävlingen av TravStat.,@ rankas 1:a av TravStat.
3,4,Gått rekord senast,17,5020,706,41120,14.063745,1830,27221,58.2436,-180.87600,19,18330,3237,18,@ med tävlingens bästa rekordtid senast @@.,@ har gått rekord i senaste lopp @@.
4,5,Flest raka segrar,9,10231,2029,96164,19.831883,4488,50044,47.3948,-60.07230,16,20476,5283,26,@ har flest raka segrar i tävlingen @@ st.,@ har flest raka segrar @@ st.

In [25]:
from utils import eng_dict
kommreg.rename(columns=eng_dict).to_csv('data/eng/commentreg.csv', index=False)

In [26]:
kommstat = read_table('data/travdata/kommstat.txt', ['id', 'tvlid', 'spar', 'kommid', 'plac', 
                                                                         'typ', 'varde', 'numplac', 'odds'])
print(kommstat.shape)
kommstat.head()

(333185, 9)

/home/valldabo/miniconda3/envs/horseracing/lib/python3.6/site-packages/IPython/core/interactiveshell.py:3185: DtypeWarning: Columns (4) have mixed types. Specify dtype option on import or set low_memory=False.
  if (yield from self.run_code(code, result)):

       id  tvlid  spar  kommid plac  typ  varde  numplac   odds
0  327721  51137     2      18    5    0   4441      5.0  111.0
1  309728  44986    12      18    3    0  23940      3.0  566.0
2  309552  44926    12      18    9    0   5000      9.0  266.0
3  309551  44921     4      11    5    0     14      5.0  269.0
4  309550  44923     8      15    5    0     20      5.0  279.0

In [27]:
from utils import eng_dict
kommstat.rename(columns=eng_dict).to_csv('data/eng/commentstat.csv', index=False)

In [28]:
kup = read_table('data/travdata/kup.txt', ['id', 'nr', 'kupnr', 'gard1', 'gard2', 
                                                               'gard3', 'gard4', 'gard5', 'gard6', 'gard7'])
print(kup.shape)
kup.head()

(26583, 10)

   id  nr  kupnr gard1 gard2 gard3 gard4 gard5 gard6 gard7
0   1   1      1     A    AB    AB    AB    AB   NaN   NaN
1   2   1      2     B     A    AB    AB    AB   NaN   NaN
2   3   1      3     B     B     A    AB    AB   NaN   NaN
3   4   1      4     B     B     B     A    AB   NaN   NaN
4   5   1      5     B     B     B     B     A   NaN   NaN

In [29]:
kuskban = read_table('data/travdata/kuskban.txt', ['id', 'bana', 'kusk', 'segrar', 'starter', 'proc'])
print(kuskban.shape)
kuskban.head()

(10782, 6)

   id bana   kusk  segrar  starter  proc
0   1   MP  12434       0        3     0
1   2    B    959       4       23    17
2   3    B     95       3       57     5
3   4    B    343      21      102    20
4   5    B   1285       2       44     4

In [30]:
from utils import eng_dict
kuskban.rename(columns=eng_dict).to_csv('data/eng/driverban.csv', index=False)

In [31]:
kusk = read_table('data/travdata/kusk.txt', ['id', 'namn', 'atgkod', 'segrar', 'starter',
                                                                 'proc', 'v75segrar', 'v75starter', 'v75proc', 'licens', 'kortnamn', 'hembana'])
print(kusk.shape)
kusk.head()

(2996, 12)

,id,namn,atgkod,segrar,starter,proc,v75segrar,v75starter,v75proc,licens,kortnamn,hembana
0,5,Kontio Jorma,Kon Jo,76.0,685.0,11.0,6.0,107.0,5.0,70381.0,Kontio J,S
1,6,Widell Kaj,Wid Ka,47.0,585.0,8.0,2.0,37.0,5.0,5599.0,Widell K,S
2,7,Söderholm Krister,Söd Kr,14.0,187.0,7.0,2.0,11.0,18.0,344.0,Söderholm K,U
3,8,Jansson Torbjörn,Jan To,31.0,505.0,6.0,8.0,91.0,8.0,3712.0,Jansson T,S
4,12,Byström John,Bys Jo,1.0,25.0,4.0,0.0,2.0,0.0,20127.0,Byström J,RO

In [32]:
from utils import eng_dict
kusk.rename(columns=eng_dict).to_csv('data/eng/driver.csv', index=False)

In [33]:
lopp = read_table('data/travdata/lopp.txt', ['id', 'horseid', 'datum', 'bana', 'lopp', 'spar',
                                                                 'distans', 'tillagg', 'placering', 'tid', 'odds', 'kusk', 'verklspar'],
                  warn_bad_lines=False, header='infer')
print(lopp.shape)
lopp.head()

(2559817, 13)

,id,horseid,datum,bana,lopp,spar,distans,tillagg,placering,tid,odds,kusk,verklspar
0,1356901.0,591.0,2009-01-22,G,8.0,7.0,L,1.0,0,179,651,Red Da,7.0
1,1355774.0,51169.0,2009-01-09,B,2.0,11.0,M,0.0,3,190,100,Hol PÅ,11.0
2,1356818.0,39640.0,2009-01-08,Ö,4.0,5.0,K,0.0,6,174a,37,Kon Jo,5.0
3,1355772.0,51743.0,2009-01-09,B,2.0,2.0,M,0.0,0,200,80,Wal Kr,2.0
4,1366458.0,41394.0,2009-02-18,S,5.0,15.0,M,1.0,0,166,1211,Lar FB,9.0

In [34]:
from utils import eng_dict
lopp.rename(columns=eng_dict).to_csv('data/eng/race.csv', index=False)

In [35]:
mlrrad = read_table('data/travdata/mlrrad.txt', ['id', 'mlrid', 'varid', 'proc', 'medel',
                                                                     'bvarde', 'varians', 'tvarde', 'sign', 'manuell'])
print(mlrrad.shape)
mlrrad.head()

(377, 10)

     id  mlrid  varid proc     medel  bvarde  varians  tvarde sign manuell
0  7155    456      0    _  5.395346     NaN      NaN     NaN    _       A
1  7356    470      0    _  5.370147     NaN      NaN     NaN    _       A
2  7395    472      0    _  5.206089     NaN      NaN     NaN    _       A
3  7611    484      0    _  5.574466     NaN      NaN     NaN    _       A
4  7812    495      0    _  5.599832     NaN      NaN     NaN    _       A

In [36]:
mlr = read_table('data/travdata/mlr.txt', ['id', 'typ', 'startsatt', 'distans', 'division', 'bana', 
                                                              'antal', 'bortfall', 'fvarde', 'datum', 'berakfromdatum', 
                                                              'bortdivision', 'bortutdelning', 'ekvgrp', 'antlopp',
                                                              'snittodds', 'beraktomdatum', 'dagensdatum', 'berakar',
                                                              'antplats', 'platsodds'])
print(mlr.shape)
mlr.head()

(34, 21)

,id,typ,startsatt,distans,division,bana,antal,bortfall,fvarde,datum,...,bortdivision,bortutdelning,ekvgrp,antlopp,snittodds,beraktomdatum,dagensdatum,berakar,antplats,platsodds
0,446,1,A,K,Z,Z,8539,342,206.103197,2019-01-31,...,U,NaN,1,886.0,28.915205,2019-01-31,1.0,NaN,564.0,22.939716
1,456,1,A,L,Z,Z,8853,298,252.139068,2019-02-09,...,U,0.0,1,850.0,23.563758,2019-02-09,1.0,NaN,553.0,27.699819
2,470,1,A,M,Z,Z,11463,414,397.695060,2019-01-31,...,U,0.0,1,1150.0,28.212560,2019-01-31,1.0,NaN,743.0,22.352624
3,472,1,A,S,Z,Z,1708,86,123.783970,2019-01-31,...,U,0.0,1,166.0,21.058140,2019-01-31,1.0,NaN,115.0,24.121739
4,484,1,V,K,Z,Z,11381,362,283.262919,2019-01-31,...,U,0.0,1,1022.0,27.729282,2019-01-31,1.0,NaN,596.0,21.800336

In [37]:
mtid = read_table('data/travdata/mtid.txt', ['id', 'datum', 'bana', 'lopp', 'senaste', 'besta'])
print(mtid.shape)
mtid.head()

(253052, 6)

   id       datum bana  lopp  senaste  besta
0   1  2011-03-03   BO     3    323.2  323.2
1   2  2011-03-06   SK     1    297.8  297.8
2   3  2011-02-03   BO     1    322.4  295.9
3   4  2011-02-21   BO     3    338.0  311.5
4   5  2011-02-21   BO     6    336.0  287.5

In [38]:
from utils import eng_dict
mtid.rename(columns=eng_dict).to_csv('data/eng/mtime.csv', index=False)

In [39]:
notering = read_table('data/travdata/notering.txt', ['id', 'horseid', 'tvlid', 'anm'])
print(notering.shape)
notering.head()

(121270, 4)

  id  horseid    tvlid                   anm
0  1  22391.0  26487.0  Vunnet med 4.5 längd
1  2  11055.0  26488.0  Vunnet med 2.5 längd
2  3  25006.0  26489.0  Vunnet med 5.5 längd
3  4  10696.0  26490.0  Vunnet med 4.5 längd
4  5  24303.0  26491.0  Vunnet med 3 längder

In [40]:
from utils import eng_dict
notering.rename(columns=eng_dict).to_csv('data/eng/note.csv', index=False)

In [41]:
odds = read_table('data/travdata/odds.txt', ['id', 'tvlid', 'kr', 'tid', 'n1', 'n2', 'n3', 'n4', 'n5', 
                                                                 'n6', 'n7', 'n8', 'n9', 'n10', 'n11', 'n12', 'n13', 'n14', 
                                                                 'n15', 'n16', 'n17', 'n18', 'n19', 'n20'])
print(odds.shape)
odds.head()

(2686440, 24)

,id,tvlid,kr,tid,n1,n2,n3,n4,n5,n6,...,n11,n12,n13,n14,n15,n16,n17,n18,n19,n20
0,24,45113,260,20:34,208,999,416,999,999,104,...,999,999,999,20,18,NaN,NaN,NaN,NaN,NaN
1,25,45114,670,20:34,999,999,999,12,53,53,...,999,999,0,0,0,NaN,NaN,NaN,NaN,NaN
2,26,45115,270,20:34,30,432,48,999,999,432,...,999,999,999,19,144,NaN,NaN,NaN,NaN,NaN
3,27,45116,150,20:34,40,999,240,999,20,999,...,999,24,0,0,0,NaN,NaN,NaN,NaN,NaN
4,28,45117,135,20:34,999,108,54,36,43,54,...,999,999,0,0,0,NaN,NaN,NaN,NaN,NaN

In [42]:
from utils import eng_dict
odds.rename(columns=eng_dict).to_csv('data/eng/odds.csv', index=False)

In [43]:
omrspar = read_table('data/travdata/omrspar.txt', ['id', 'typ', 'dist', 'spar', 'varde', 'tid', 'segerp'])
print(omrspar.shape)
omrspar.head()

(1440, 7)

   id typ  dist  spar     varde         tid     segerp
0   1   A     1     1  0.907530  148.695224  23.182340
1   2   A     1     2  0.911008  148.836392  23.411677
2   3   A     1     3  0.912329  148.735250  23.466129
3   4   A     1     4  0.909569  148.370707  27.555118
4   5   A     1     5  0.907806  147.837564  29.360869

In [44]:
omr = read_table('data/travdata/omr.txt', ['id', 'typ', 'dist', 'varde'])
print(omr.shape)
omr.head()

(32, 4)

   id typ  dist  varde
0   1   1     1  0.962
1   2   1     2  1.106
2   3   1     3  1.061
3   4   1     4  1.065
4   5   2     1  0.963

In [45]:
parm = read_table('data/travdata/parm.txt', ['id', 'modell', 'modstart', 'modslut', 'oddsgrans', 'negodds', 'posodds', 
                                                                 'favoritkvar', 'sluant', 'sluval', 'passwd', 'anvid', 'slumprader', 'slumptyp', 
                                                                 'favoritspel', 'stabilitet', 'startproc', 'subject', 'mailhost', 'userid',
                                                                 'email', 'skickaram', 'skickasyst',
                                                               'stabmaxodds', 'mailpassword'])
parm.head()

,id,modell,modstart,modslut,oddsgrans,negodds,posodds,favoritkvar,sluant,sluval,...,stabilitet,startproc,subject,mailhost,userid,email,skickaram,skickasyst,stabmaxodds,mailpassword
0,1,XXZZ,1995-08-19,NaN,200,80,20,N,NaN,NaN,...,1,80,Veckans Trav,mail1.telia.com,u97007254,lars.0970.14443@telia.com,NaN,0,150,GU!VFKs2

In [46]:
pris = read_table('data/travdata/pris.txt', ['tvlid', 'typ', 'pris1', 'pris2', 'pris3', 'pris4',
                                                                 'pris5', 'pris6', 'pris7', 'pris8', 'pris9', 'pris10'])
print(pris.shape)
pris.head()

(175452, 12)

,tvlid,typ,pris1,pris2,pris3,pris4,pris5,pris6,pris7,pris8,pris9,pris10
0,102753,4,15000.0,7500.0,5000.0,3500.0,2800.0,2000.0,2000.0,NaN,NaN,NaN
1,102413,4,15000.0,7500.0,5000.0,NaN,NaN,NaN,NaN,2000.0,NaN,NaN
2,95489,4,NaN,NaN,NaN,NaN,NaN,2000.0,NaN,NaN,NaN,NaN
3,94888,4,NaN,NaN,5000.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,102019,4,NaN,5000.0,NaN,NaN,1800.0,NaN,NaN,NaN,NaN,NaN

In [47]:
pris.columns = pris.columns.str.replace('pris', 'price')
from utils import eng_dict
pris.rename(columns=eng_dict).to_csv('data/eng/price.csv', index=False)

In [48]:
prog = read_table('data/travdata/prog.txt', ['id', 'tvlid', 'horseid', 'spar', 'kusk', 'pvalue', 'tid', 'verklspar', 'plac', 'rank', 'atgkod', 'odds1',
                                                                'v1', 'v2', 'v3', 'v4', 'v5', 'v6', 'v7', 'v8', 'v9', 
                                                                 'v10', 'v11', 'v12', 'v13', 'v14', 'v15', 'v16', 'v17', 'v18', 'v19',
                                                                 'v20', 'v21', 'v22', 'v23', 'v24', 'v25', 'v26', 'v27', 'v28', 'v29', 
                                                                 'v30', 'v31', 'v32', 'v33', 'v34', 'v35', 'v36', 'v37', 'v38', 'v39',
                                                                 'v40', 'v41', 'v42', 'v43', 'v44', 'v45', 'v46', 'v47', 'v48', 'v49', 
                                                                 'v50', 'v51', 'v52', 'v53', 'v54', 'v55', 'v56',
                                                                'stabilitet', 'stabb', 'bort', 'pvalue2', 'stid', 'diff', 'tidsrank', 'tidsplac', 'tidsrank2',
                                                                'v57', 'v58', 'v59', 'v60', 'ranktid', 'v61', 'v62', 'bana', 'avdv75', 'v63', 'v64', 'v65', 'v66',
                                                                'agarnr', 'tranarnr', 'v67', 'uppehall', 'v68', 'v69', 'v70', 'v71', 'v72', 'v73',
                                                                'antstreck', 'v74', 'v75', 'v76', 'v77', 'v78', 'v79',
                                                                'v80', 'v81', 'v82', 'v83', 'v84', 'v85', 'v86', 'v87', 'v88', 'v89',
                                                                'v90', 'v91', 'v92', 'v93', 'v94', 'v95', 'v96', 'v97', 'v98', 'v99'])
print(prog.shape)
prog.head()

/home/valldabo/miniconda3/envs/horseracing/lib/python3.6/site-packages/IPython/core/interactiveshell.py:3185: DtypeWarning: Columns (70) have mixed types. Specify dtype option on import or set low_memory=False.
  if (yield from self.run_code(code, result)):

(1905068, 127)

,id,tvlid,horseid,spar,kusk,pvalue,tid,verklspar,plac,rank,...,v90,v91,v92,v93,v94,v95,v96,v97,v98,v99
0,190657,17450,23900,1,3824,1.71,228,1.0,4,2.0,...,11.0,2.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,190658,17450,9081,2,1346,1.00,217,2.0,1,1.0,...,29.0,1.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,190659,17450,23336,3,211,2.12,228,3.0,5,3.0,...,9.0,3.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,190660,17450,15541,4,1163,2.23,219,4.0,2,4.0,...,7.0,4.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,190661,17450,23556,5,484,2.71,265,5.0,O,7.0,...,5.0,7.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [49]:
prog.columns = prog.columns.str.replace('tid', 'time')
from utils import eng_dict
prog.rename(columns=eng_dict).to_csv('data/eng/programe.csv', index=False)

In [50]:
raka = read_table('data/travdata/raka.txt', ['ant', 'segrar', 'starter', 'proc'])
print(raka.shape)
raka.head()

(11, 4)

   ant  segrar  starter  proc
0    0   19432   232535   835
1    1    3059    18474  1655
2    2    1024     4735  2162
3    3     375     1191  3148
4    4     152      443  3431

In [51]:
redu = read_table('data/travdata/redu.txt', ['nr', 'typ', 'konstr', 'garderade', 'osym', 'antkup', 
                                                                 'anta', 'antb', 'antc', 'antd', 'ante', 'antf', 'pris', 'vint', 'utv', 'rf'])
print(redu.shape)
redu.head()

(494, 16)

,nr,typ,konstr,garderade,osym,antkup,anta,antb,antc,antd,ante,antf,pris,vint,utv,rf
0,1,AB,Guiden,5,0.0,5,1,14.0,NaN,NaN,NaN,NaN,0,0,1.0,84.0
1,483,AB,TravStat,5,NaN,12,1,14.0,NaN,NaN,NaN,NaN,0,0,NaN,NaN
2,3,ABC,DATASYSTEM,3,0.0,12,1,2.0,12.0,NaN,NaN,NaN,0,0,1.0,258.0
3,4,ABCD,JINMAR,4,2.0,10,1,2.0,2.0,10.0,NaN,NaN,0,0,0.0,28.0
4,5,ABC,JINMAR,4,0.0,6,1,2.0,12.0,NaN,NaN,NaN,0,0,0.0,20.0

In [52]:
rshuv= read_table('data/travdata/rshuv.txt', ['id', 'datum1', 'datum2'])
print(rshuv.shape)
rshuv.head()

(6, 3)

   id      datum1      datum2
0   2  2012-11-02  2018-01-28
1   1  2000-01-01  2017-12-31
2   4  2000-05-21  2018-01-28
3   5  2015-01-01  2018-01-28
4   3  2009-01-01  2016-03-25

In [53]:
rsreg = read_table('data/travdata/rsreg.txt', ['id', 'vnr', 'medel', 'bvarde'])
print(rsreg.shape)
rsreg.head()

(12, 4)

   id  vnr      medel    bvarde
0   1    0   4.837242  0.000000
1   1    1  23.038293  0.124200
2   2    0   4.023777  0.000000
3   2    1  16.848558  0.145861
4   3    0   4.063008  0.000000

In [54]:
rssum = read_table('data/travdata/rssum.txt', ['id', 'nr', 'variabel', 'skattning', 'utdelning'])
print(rssum.shape)
rssum.head()

(10395, 5)

   id   nr  variabel     skattning  utdelning
0   6   22        17  14367.679501       2694
1   6   23        17  14367.679501       1996
2   5  522        15   5069.990260       4755
3   5  521        15   5069.990260       6243
4   6   65        21  27788.250410      16973

In [55]:
shhuv = read_table('data/travdata/shhuv.txt', ['id', 'datum1', 'datum2', 'A', 'R'])
print(shhuv.shape)
shhuv.head()

(6, 5)

   id      datum1      datum2             A         R
0   1  2011-11-21  2013-02-18  1.127464e+09 -3.652690
1   2    1/1/2002   3/27/2014  3.856121e+08 -3.515305
2   3  2010-12-12  2013-02-18  6.313798e+06 -2.700344
3   4  2000-01-01  2013-07-02  3.234214e+07 -3.338440
4   5  2012-03-06  2013-02-18  3.907115e+05 -2.531490

In [56]:
shsum = read_table('data/travdata/shsum.txt', ['id', 'nr', 'variabel', 'skattning', 'utdelning'])
print(shsum.shape)
shsum.head()

(2658, 5)

   id  nr  variabel     skattning  utdelning
0   1   1      1.56  3.779266e+06    1664856
1   1   2      1.64  2.821629e+06     222773
2   1   3      1.65  2.720424e+06    1036948
3   1   4      1.81  1.516427e+06    4359504
4   1   5      1.83  1.409596e+06    2258280

In [57]:
sparklass = read_table('data/travdata/sparklass.txt', ['id', 'klass', 'startsatt', 'distans', 
                                                                           'tillag', 'spar', 'segrar', 'starter', 'proc'])
print(sparklass.shape)
sparklass.head()

(1925, 9)

   id klass startsatt distans  tillag  spar  segrar  starter  proc
0   1     V         V       S      20     1   230.0     3345     6
1   2     V         V       S       0     4   126.0     2342     5
2   3     V         V       S       0     5    73.0     1393     5
3   4     V         V       S      40     1   304.0     2824    10
4   5     V         V       S      20     3   179.0     2834     6

In [58]:
spar = read_table('data/travdata/spar.txt', ['id', 'klass', 'startsatt', 'distans', 'tillag', 
                                                                 'spar', 'segrar', 'starter', 'proc'])
print(spar.shape)
spar.head()

(9081, 9)

   id klass startsatt distans  tillag  spar  segrar  starter  proc
0   1     _         V       K       0     1  1115.0     7373    15
1   2     J         V       K       0     1    92.0      558    16
2   3     _         V       K       0     2   786.0     7051    11
3   4     J         V       K       0     2    71.0      539    13
4   5     _         V       K       0     3   765.0     6925    11

In [59]:
spelutv = read_table('data/travdata/spelutv.txt', ['id', 'datum', 'bana', 'typ', 'systemnr', 'maxkr', 'dtyp', 
                                                                       'pris', 'vinst', 'a7', 'a6', 'a5', 'a4', 'spikar', 'spiktyp', 'rader1', 
                                                                       'rader', 'maxhastar', 'spikratt', 'ack'])
print(spelutv.shape)
spelutv.head()

(69012, 20)

,id,datum,bana,typ,systemnr,maxkr,dtyp,pris,vinst,a7,a6,a5,a4,spikar,spiktyp,rader1,rader,maxhastar,spikratt,ack
0,132267,2007-01-16,AX,V5,1,250,0,210,0,0,0,0,0,1,2,210.0,210.0,7,0,1353.0
1,132268,2007-01-15,F,V5,1,250,0,240,0,0,0,0,0,1,2,240.0,140.0,7,0,1113.0
2,132269,2007-01-22,F,V5,1,250,0,168,0,0,0,0,0,1,2,168.0,168.0,7,0,945.0
3,132270,2007-01-25,B,V5,1,250,0,210,0,0,0,0,0,1,2,210.0,210.0,7,0,735.0
4,132271,2007-01-26,KR,V5,1,250,0,216,0,0,0,0,0,1,2,216.0,210.0,7,0,519.0

In [60]:
from utils import eng_dict
spelutv.rename(columns=eng_dict).to_csv('data/eng/gamedev.csv', index=False)

In [61]:
tranare = read_table('data/travdata/tranare.txt', ['id', 'namn', 'segrar', 'starter', 'proc'])
print(tranare.shape)
tranare.head()

(15051, 5)

   id             namn  segrar  starter  proc
0   1    Marklund Lars    90.0   1592.0   5.0
1   2       Skytén Jan     3.0     44.0   6.0
2   3      Östman John    20.0    317.0   6.0
3   4  Lindvall Yvonne     2.0     47.0   4.0
4   5   Lindegren Erik   177.0   1626.0  10.0

In [62]:
from utils import eng_dict
tranare.rename(columns=eng_dict).to_csv('data/eng/coach.csv', index=False)

In [63]:
tvldag = read_table('data/travdata/tvldag.txt', ['id', 'datum', 'bana', 'typ', 'cfg', 'dd1', 'starttid', 'oms',
                                                                    'antsyst', 'sh', 'grad', 'dd2', 'ld', 'ld1', 'ld2'])
print(tvldag.shape)
tvldag.sample(10)

(18834, 15)

,id,datum,bana,typ,cfg,dd1,starttid,oms,antsyst,sh,grad,dd2,ld,ld1,ld2
18228,20820,2018-09-17,E,V64,223,8.0,NaN,4704049.0,NaN,1.59,NaN,9.0,NaN,NaN,NaN
14011,16459,2015-06-25,E,V4,209,NaN,NaN,2824369.0,NaN,0.86,NaN,NaN,LD,2.0,3.0
12570,14986,2014-04-07,RÄ,V4,557,NaN,10:35,2184132.0,NaN,0.81,NaN,NaN,NaN,NaN,NaN
8846,10946,2010-06-26,ÅR,V5,557,NaN,NaN,NaN,NaN,1.16,83.250,NaN,NaN,NaN,NaN
17442,20025,2018-02-16,OP,V5,323,NaN,NaN,906195.0,NaN,1.34,NaN,NaN,NaN,NaN,NaN
1045,2574,2002-05-02,E,V5,399,398788.0,NaN,NaN,NaN,2.25,46.137,NaN,NaN,NaN,NaN
13095,15521,2014-09-18,BJ,V5,295,NaN,03:17,1522436.0,NaN,1.34,NaN,NaN,NaN,NaN,NaN
8822,10922,2010-06-16,ÅM,V5,545,NaN,NaN,NaN,NaN,1.44,92.269,NaN,NaN,NaN,NaN
14310,16766,2015-09-20,S,V4,233,NaN,NaN,183106.0,NaN,0.97,NaN,NaN,NaN,NaN,NaN
4856,6387,2005-10-25,G,V5,411,452067.0,NaN,NaN,NaN,2.09,60.941,NaN,NaN,NaN,NaN

In [64]:
tvlkva = read_table('data/travdata/tvlkva.txt', ['id'] + ['s' + str(i) for i in range(1, 100)])
print(tvlkva.shape)
tvlkva.head()

(172176, 100)

,id,s1,s2,s3,s4,s5,s6,s7,s8,s9,...,s90,s91,s92,s93,s94,s95,s96,s97,s98,s99
0,78523,1009,22221,1150,48104,2073,56529,23,3,5,...,1365.0,650.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,78522,4658,41913,1154,20785,1919,27536,14,39,27,...,1005.0,650.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,78521,73,5,475,25564,1135,29218,22,2,2,...,1306.0,140.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,78520,579,20289,704,25066,1110,43750,5,5,5,...,951.0,140.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,78555,235,273,1286,34478,1331,38522,75,2,2,...,1746.0,1240.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [65]:
tvlsum = read_table('data/travdata/tvlsum.txt', ['id'] + ['s' + str(i) for i in range(1, 100)])
print(tvlsum.shape)
tvlsum.head()

(172176, 100)

,id,s1,s2,s3,s4,s5,s6,s7,s8,s9,...,s90,s91,s92,s93,s94,s95,s96,s97,s98,s99
0,78523,101,1541,110,2378,155,16165,11,3,3,...,89.0,78.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,78522,196,723,116,4403,151,25726,6,13,13,...,63.0,78.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,78521,11,3,53,2958,89,14798,10,2,2,...,76.0,28.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,78520,41,583,58,1184,88,12910,3,3,3,...,53.0,28.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,78555,37,35,128,6692,139,21458,25,2,2,...,132.0,120.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [66]:
tvl = read_table('data/travdata/tvl.txt', ['id', 'datum', 'bana', 'lopp', 'startsatt', 'distans', 
                                                               'division', 'banforh', 'v5', 'v75', 'v86', 'v65', 'forstapris',
                                                               'loppid', 'startid', 'konhv', 'antilopp'])
print(tvl.shape)
tvl.sample(10)

(172027, 17)

/home/valldabo/miniconda3/envs/horseracing/lib/python3.6/site-packages/IPython/core/interactiveshell.py:3185: DtypeWarning: Columns (14) have mixed types. Specify dtype option on import or set low_memory=False.
  if (yield from self.run_code(code, result)):

,id,datum,bana,lopp,startsatt,distans,division,banforh,v5,v75,v86,v65,forstapris,loppid,startid,konhv,antilopp
19946,32973,2003-08-28,Ö,3,V,M,V,NaN,1.0,0.0,NaN,NaN,15000.0,514415.0,NaN,9,12
81893,97369,2010-11-01,BS,1,A,M,V,NaN,1.0,NaN,NaN,NaN,25000.0,NaN,NaN,10,10
1309,76303,2008-07-06,E,5,V,M,V,NaN,3.0,NaN,NaN,NaN,20000.0,653835.0,NaN,9,14
20872,33899,2003-09-30,G,1,V,M,U,NaN,NaN,0.0,NaN,NaN,18000.0,517046.0,NaN,10,10
84798,100288,2011-03-08,ÖS,4,V,M,K,NaN,2.0,NaN,NaN,NaN,40000.0,NaN,NaN,5,6
99234,117641,2012-11-23,BO,2,V,K,K,NaN,2.0,NaN,NaN,NaN,25000.0,NaN,12:40,13,13
4961,17984,2002-02-07,Ö,4,V,L,Q,NaN,2.0,0.0,NaN,NaN,0.0,464622.0,NaN,0,13
169975,188780,2018-12-17,E,9,V,M,V,NaN,6.0,NaN,NaN,NaN,30000.0,NaN,21:00,12,14
45,77566,2008-08-16,RO,6,A,M,G,NaN,5.0,3.0,NaN,NaN,150000.0,657615.0,NaN,12,12
108011,126398,2013-10-02,S,9,A,M,V,NaN,NaN,NaN,6.0,NaN,50000.0,NaN,21:00,0,12

In [67]:
from utils import eng_dict
tvl.rename(columns=eng_dict).to_csv('data/eng/competition.csv', index=False)

In [68]:
uppehall = read_table('data/travdata/uppehall.txt', ['ant', 'segrar', 'starter', 'proc'])
print(uppehall.shape)
uppehall.head()

(22, 4)

   ant  segrar  starter  proc
0   21     817     9733   839
1   20      67      721   929
2   19      67      760   881
3   18      59      800   737
4   17      81      946   856

In [69]:
columns = ['id'] + ['ratt' + str(i) for i in reversed(range(4, 9))] 
for name in  ['progv', 'rank', 'vinnare', 'odds', 'streck']:
    columns += [name + str(i) for i in range(1, 9)]
columns += ['datum', 'bana']
columns += ['plats' + str(i) for i in range(1, 9)] + ['typ', 'NA']

utd = read_table('data/travdata/utd.txt', columns)
print(utd.shape)
utd.head()

(17987, 58)

,id,ratt8,ratt7,ratt6,ratt5,ratt4,progv1,progv2,progv3,progv4,...,plats1,plats2,plats3,plats4,plats5,plats6,plats7,plats8,typ,NA
0,13349.0,NaN,NaN,NaN,306953.0,NaN,3.14,3.68,5.83,7.51,...,18.0,26.0,60.0,110.0,18.0,NaN,NaN,NaN,V5,NaN
1,13351.0,0.0,0.0,0.0,0.0,866.0,1.00,1.70,4.56,1.00,...,14.0,21.0,54.0,18.0,NaN,NaN,NaN,NaN,V4,NaN
2,13348.0,0.0,0.0,67116.0,510.0,43.0,5.81,1.00,1.00,5.30,...,23.0,18.0,16.0,32.0,14.0,59.0,NaN,NaN,V64,NaN
3,13347.0,0.0,0.0,3500.0,170.0,0.0,1.00,1.16,1.59,3.89,...,15.0,19.0,17.0,17.0,20.0,24.0,NaN,NaN,V65,NaN
4,13343.0,0.0,1806133.0,12039.0,550.0,0.0,1.00,5.99,3.93,3.61,...,15.0,38.0,65.0,38.0,20.0,17.0,35.0,NaN,V75,NaN

In [70]:
[c for c in utd]

['id',
 'ratt8',
 'ratt7',
 'ratt6',
 'ratt5',
 'ratt4',
 'progv1',
 'progv2',
 'progv3',
 'progv4',
 'progv5',
 'progv6',
 'progv7',
 'progv8',
 'rank1',
 'rank2',
 'rank3',
 'rank4',
 'rank5',
 'rank6',
 'rank7',
 'rank8',
 'vinnare1',
 'vinnare2',
 'vinnare3',
 'vinnare4',
 'vinnare5',
 'vinnare6',
 'vinnare7',
 'vinnare8',
 'odds1',
 'odds2',
 'odds3',
 'odds4',
 'odds5',
 'odds6',
 'odds7',
 'odds8',
 'streck1',
 'streck2',
 'streck3',
 'streck4',
 'streck5',
 'streck6',
 'streck7',
 'streck8',
 'datum',
 'bana',
 'plats1',
 'plats2',
 'plats3',
 'plats4',
 'plats5',
 'plats6',
 'plats7',
 'plats8',
 'typ',
 'NA']

In [71]:
utd.columns = utd.columns.str.replace('ratt', 'correct').str.replace('vinnare', 'winner').str.replace('streck', 'cross').str.replace('plats', 'place')
from utils import eng_dict
utd.rename(columns=eng_dict).to_csv('data/eng/pricemoney.csv', index=False)

In [72]:
utlmtid = read_table('data/travdata/utlmtid.txt', ['horseid', 'datum', 'bana', 'lopp', 'mtid'])
print(utlmtid.shape)
utlmtid.head()

(145108, 5)

   horseid       datum bana  lopp  mtid
0       46  2003-08-09   OV     1   364
1       46  2005-07-19   OV     4   295
2       46  2008-07-22   OV     7   317
3       88  2006-06-24   OV     4   151
4       88  2006-07-18   OV     7   149

In [73]:
varkollhuv = read_table('data/travdata/varkollhuv.txt', ['id', 'startsatt', 'distans', 'division', 'bana',
                                                                            'datumfrom', 'datumtom', 'antal'])
print(varkollhuv.shape)
varkollhuv.head()

(9, 8)

    id startsatt distans division bana   datumfrom    datumtom   antal
0   14         A       K        Z    Z  1994-01-01  2005-03-21   74367
1   78         V       M        Z    Z  1994-01-01  2005-03-22  244944
2   64         V       M        1    Z  1994-01-01  2005-04-12    1874
3   38         A       M        Z    Z  1994-01-01  2005-07-18  139114
4  146         A       K        2    Z  1994-01-01  2005-12-12       0

In [74]:
varkolltmp = read_table('data/travdata/varkolltmp.txt', ['id', 'tvlid', 'spar', 'varid', 'varde'])
print(varkolltmp.shape)
varkolltmp.head()

(1083, 5)

       id  tvlid  spar  varid  varde
0  111240  53114     5      0      0
1  111241  53391     3      0      0
2  111242  53391     5      0      0
3  111243  53391     8      0      0
4  111244  53391    10      0      0

In [75]:
varkoll = read_table('data/travdata/varkoll.txt', ['id', 'huvid', 'varid', 'utomgrans', 'bortfall', 'noll', 'godk'])
print(varkoll.shape)
varkoll.head()

(102, 7)

   id  huvid  varid  utomgrans  bortfall  noll  godk
0   1     14      0          0         0     0     0
1   2     14      3          0         0     0     0
2   3     14      5          0         0     0     0
3   4     14      7          0         0     0     0
4   5     14      9          0         0     0     0

In [76]:
vpla = read_table('data/travdata/vpla.txt', ['id', 'rank', 'VINNARE', 'PROC', 'ODDS'])
print(vpla.shape)
vpla.head()

(134, 5)

   id  rank  VINNARE       PROC  ODDS
0   4     1        8  80.000000    12
1   4     2        1  10.000000   100
2   4     3        0   0.000000   999
3   4     4        1  10.000000   100
4   5     1       44  50.574713    20

In [77]:
winp2huv = read_table('data/travdata/winp2huv.txt', ['typ', 'datum1', 'datum2'])
print(winp2huv.shape)
winp2huv.head()

(6, 3)

   typ      datum1      datum2
0  V75  2011-01-01  2015-07-07
1  V86  2012-09-01  2015-03-27
2  V64  2011-01-01  2015-03-27
3  V65  2011-01-01  2015-03-27
4   V5  2013-01-01  2015-03-27

In [78]:
winp2 = read_table('data/travdata/Winp2.txt', ['typ', 'rank', 'ant', 'vinnare', 'procent', 'odds'])
print(winp2.shape)
winp2.head()

(90, 6)

   typ  rank   ant  vinnare    procent  odds
0  V86     2   975      159  16.307692    61
1  V75    12  3037       44   1.448798   690
2  V75    11  3293       65   1.973884   507
3  V75    10  3344       95   2.840909   352
4  V75     9  3288      101   3.071776   326